# -*- coding: utf-8 -*-
# 细胞分裂问题
"""
细胞分裂 有一个细胞 每一个小时分裂一次，一次分裂一个子细胞，第三个小时后会死亡。那么n个小时候有多少细胞？试着分析下这个递归算法的时间复杂度是多少呢
"""

# 思路分析
# 第一个小时，只有a态细胞；第二个小时，a态细胞分裂，原来的a态细胞变成了b态细胞，分裂出来的细胞变成了新的a态细胞；第三个小时，a态细胞继续分裂变成b态细胞和新的a态细胞，b态细胞分裂变成c态细胞和a态细胞；第四个小时，a、b、c态细胞都会分裂，并且按照之前的规律转变。得出下面的结论
# a 初始态 一个小时 前一个小时的 a+b+c
# b 幼年态 两个小时 前一个小时的 a
# c 成熟态 三个小时 前一个小时的 b

# 假设第一个小时的时候细胞个数为1，即f(1) = 1
# 并且为了问题的简便，假设是细胞先分裂再死亡


def all_cell(n: int) -> int:
    # a态细胞
    def a_cell(n: int) -> int:
        if n == 1:
            return 1
        else:
            return a_cell(n-1) + b_cell(n-1) + c_cell(n-1)

    def b_cell(n: int) -> int:
        if n == 1:
            return 0
        else:
            return a_cell(n-1)

    def c_cell(n: int) -> int:
        if n == 1 or n == 2:
            return 0
        else:
            return b_cell(n-1)

    if n < 1:
        # n 必须大于等于1
        return 0
    else:
        return a_cell(n) + b_cell(n) + c_cell(n)


# 关于 n-4 而不是n-3
# 除了找规律和不完全推导的方法，自己解释下为啥是n-4，而不是n-3,假设此时n=6,那么我们应该减掉这个先分裂然后死亡的那部分细胞，
# 但是这部分细胞其实是n=2到n=3这一波分裂的细胞，不能减去f(n-3)，因为f(n-3)里面有部分细胞在之前已经死亡了
# 推导部分数据如下
# n   a    b   c   all
# 1   1            1
# 2   1    1       2
# 3   2    1   1   4
# 4   4    2   1   7
# 5   7    4   2   13
# 6   13   7   4   24

# 时间复杂度和斐波拉契差不多都是O(2**n)， 对数级别
def all_cell2(n: int) -> int:
    if n < 1:
        return 0
    if n == 1:
        return 1
    elif n == 2:
        return 2
    elif n == 3:
        return 4
    elif n == 4:
        return 7
    else:
        return 2 * all_cell2(n-1) - all_cell2(n-4)


if __name__ == '__main__':
    for i in range(1, 11):
        print('第{n}个小时， 细胞个数是{cell_num}'.format(n=i, cell_num=all_cell(i)))
        print('第{n}个小时， 细胞个数是{cell_num}'.format(n=i, cell_num=all_cell2(i)))
        print('----' * 40)

"""     
第1个小时， 细胞个数是1
第1个小时， 细胞个数是1
----------------------------------------------------------------------------------------------------------------------------------------------------------------
第2个小时， 细胞个数是2
第2个小时， 细胞个数是2
----------------------------------------------------------------------------------------------------------------------------------------------------------------
第3个小时， 细胞个数是4
第3个小时， 细胞个数是4
----------------------------------------------------------------------------------------------------------------------------------------------------------------
第4个小时， 细胞个数是7
第4个小时， 细胞个数是7
----------------------------------------------------------------------------------------------------------------------------------------------------------------
第5个小时， 细胞个数是13
第5个小时， 细胞个数是13
----------------------------------------------------------------------------------------------------------------------------------------------------------------
第6个小时， 细胞个数是24
第6个小时， 细胞个数是24
----------------------------------------------------------------------------------------------------------------------------------------------------------------
第7个小时， 细胞个数是44
第7个小时， 细胞个数是44
----------------------------------------------------------------------------------------------------------------------------------------------------------------
第8个小时， 细胞个数是81
第8个小时， 细胞个数是81
----------------------------------------------------------------------------------------------------------------------------------------------------------------
第9个小时， 细胞个数是149
第9个小时， 细胞个数是149
----------------------------------------------------------------------------------------------------------------------------------------------------------------
第10个小时， 细胞个数是274
第10个小时， 细胞个数是274
----------------------------------------------------------------------------------------------------------------------------------------------------------------
"""
